Revit.Elements.FamilyInstance
A Revit FamilyInstance

Revit.Elements.FamilyInstance.#ctor(Autodesk.Revit.DB.FamilyInstance)
Wrap an existing FamilyInstance.
instance:

Revit.Elements.FamilyInstance.#ctor(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Level)
Internal constructor for a FamilyInstance

Revit.Elements.FamilyInstance.#ctor(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ)
Internal constructor for a FamilyInstance

Revit.Elements.FamilyInstance.InitFamilyInstance(Autodesk.Revit.DB.FamilyInstance)
Initialize a FamilyInstance element
instance:

Revit.Elements.FamilyInstance.InitFamilyInstance(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Level)
Initialize a FamilyInstance element

Revit.Elements.FamilyInstance.InitFamilyInstance(Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ)
Initialize a FamilyInstance element

Revit.Elements.FamilyInstance.ByPoint(Revit.Elements.FamilySymbol,Autodesk.DesignScript.Geometry.Point)
Place a Revit FamilyInstance given the FamilySymbol (also known as the FamilyType) and it's coordinates in world space
familySymbol:
point:
Returns:

Revit.Elements.FamilyInstance.ByCoordinates(Revit.Elements.FamilySymbol,System.Double,System.Double,System.Double)
Place a Revit FamilyInstance given the FamilySymbol (also known as the FamilyType) and it's coordinates in world space
familySymbol:
x: X coordinate in meters
y: Y coordinate in meters
z: Z coordinate in meters
Returns:

Revit.Elements.FamilyInstance.ByPointAndLevel(Revit.Elements.FamilySymbol,Autodesk.DesignScript.Geometry.Point,Revit.Elements.Level)
Place a Revit FamilyInstance given the FamilySymbol (also known as the FamilyType), it's coordinates in world space, and the Level
familySymbol:
point: Point in meters
level:
Returns:

Revit.Elements.FamilyInstance.ByFamilySymbol(Revit.Elements.FamilySymbol)
Obtain a collection of FamilyInstances from the Revit Document and use them in the Dynamo graph
familySymbol:
Returns:

Revit.Elements.FamilyInstance.FromExisting(Autodesk.Revit.DB.FamilyInstance,System.Boolean)
Construct a FamilyInstance from the Revit document.
familyInstance:
isRevitOwned:
Returns:

Revit.Elements.FamilyInstance.SetRotation(System.Double)
Sets the Euler angle of the family instance around its local Z-axis.
degree: The Euler angle around Z-axis.
Returns: The result family instance.

Revit.Elements.FamilyInstance.Symbol
Gets family symbol of the specific family instance

Revit.Elements.FamilyInstance.Location
Gets the location of the specific family instance

Revit.Elements.FamilyInstance.FacingOrientation
Gets the FacingOrientation of the family instance